The  RepeatingReferenceSource  type exposes the following members.
 Methods
Name  |   Description
Dispose
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetBounds
 Returns information about the boundaries of the repeating reference array.
GetDefaultRepeatingReferenceSource
 Returns the default repeating reference source for a given element.
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetReference
 Returns an individual repeating reference given by coordinates in the array, or    a null reference (  Nothing  in Visual Basic)  if there is no reference at the coordinates (for example if there is a hole in a divided surface.)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
HasRepeatingReferenceSource
 Determines whether an element has any repeating reference sources that can be used when creating component repeaters.
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 See Also
  RepeatingReferenceSource Class
  Autodesk.Revit.DB Namespace